---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceBrowserData.GetResources
source: html/616cff02-a764-70ad-251b-c0b494145c74.htm
---
# Autodesk.Revit.DB.ExternalResourceBrowserData.GetResources Method

Gets the external resources under the folder path of the browser data.

## Syntax (C#)
```csharp
public IList<ExternalResourceReference> GetResources()
```

## Returns
The external resources under current folder of the browser data.